export const questions = [
  {
    url: "https://youtu.be/184zUaSjmUo?start=13&end=14",
    answers: ["だ", "い", "じょ", "う", "ぶ"],
    description: "這個詞意思是「沒關係」、「沒事」或「沒問題」。使用場景：當有人擔心或問你是否需要幫助時，你可以使用這個詞來告訴對方一切都好，並且你並不需要額外的幫助。例如，如果有人問你是否需要幫忙，你可以回答「だいじょうぶです」來表示你沒有問題。",
  },
  {
    url: "https://youtu.be/184zUaSjmUo?start=14&end=16",
    answers: ["ぼく", "さいきょう", "だから"],
    description: "這句話通常用於玩笑或自信的口吻，表達自己的優越感或強大能力。例如，如果朋友問你為什麼你總是贏得遊戲，你可以開玩笑地回答「ぼくさいきょうだから」。"
  },
  {
    url: "https://youtu.be/U6wS1wOCcBk?start=36&end=42",
    answers: ["ま", "じ"],
    description: "「まじ」是一個在日語中常見的俚語，有多種含義，具體取決於上下文和語氣。以下是其中一些常見的意思：「真的」、「確實」、「實在」：這是最常見的用法，表示事情的真實性或確實性。例如，如果有人告訴你一個令人驚訝的事實，你可以用「まじ」表示你對其的確信或驚訝。「認真」、「誠實」：這表示你是認真的，或者你希望別人相信你是真心的。它可以用於回答一個問題或表達你的真實意圖。例如，如果有人質疑你的誠意，你可以回答「まじで」，表示你是認真的。「無聊」、「無意義」：有時「まじ」也可以表示對某件事感到無聊、無趣或沒有意義。這種用法通常帶有一種輕鬆的口吻。例如，當你在做一件乏味的工作時，你可以嘆氣地說「まじでつまんないな」，表示你覺得這件事很無聊。需要注意的是，「まじ」是一個非正式的俚語詞彙，應該在非正式的場合使用，避免在正式或正式的場合使用。同樣，使用時要注意語氣和上下文，以確保傳達正確的意思。"
  },
  {
    url: "https://youtu.be/nAx5mdVPl_g?t=2",
    answers: ["わ", "く", "わ", "く"],
    description: "你可以在期待某件事情、感到興奮或緊張時使用這個詞。例如，當你即將參加一個重要的活動或旅行時，你可以說「わくわく」來表達你的興奮和期待。",
  },
  {
    url: "https://youtu.be/aZuiL-lgrTw?start=62&end=64",
    answers: ["アーニャ", "これ", "すき"],
    description: "這句話的意思是「我喜歡這個」，其中「アーニャ」是一個名字，「これ」表示「這個」，「すき」表示「喜歡」。 使用場景：你可以在看到某個東西、產品、食物或活動時使用這句話，表達你對它的喜愛和喜歡程度。例如，如果你看到一個你喜歡的商品，你可以說「アーニャこれすき」來表示你喜歡它。"
  },
  {
    url: "https://youtu.be/aZuiL-lgrTw?start=91&end=93",
    answers: ["む", "ず", "か", "し", "い", "よ"],
    description: "你可以在面對困難、挑戰或複雜的情況時使用這句話，表達你對其難度的感受或提醒其他人事情的困難程度。例如，當某人問你是否可以完成一個困難的任務時，你可以回答「むずかしいよ」來表達你認為這很難。"
  },
  {
    url: "https://youtu.be/jhCRo5_2X6M?start=285&end=290",
    answers: ["だ", "か", "ら", "ど", "う", "し", "た"],
    description: "意思是「那又怎樣？」，表示對某事的不在意或不在乎。這句話可以用於回應他人的觀點、挑釁或輕描淡寫一件事情的重要性。它是一種非正式的口語表達方式，適用於日常對話中。"
  },
  {
    url: "https://youtu.be/tknn02o0B5o?start=89&end=92",
    answers: ["う", "ま", "い"],
    description: "你可以在品嚐美食時使用這個詞來表達你對食物的讚美，或者在看到某人展示出優秀的技能時使用這個詞來表示欣賞和讚賞。例如，當你吃了一口美味的料理時，你可以說「うまい！」來表達你的讚美之情。"
  },
  {
    url: "https://youtu.be/aZuiL-lgrTw?start=19&end=21",
    answers: ["お", "は", "よ", "う", "ご", "ざ", "い", "ま", "す"],
  },
  {
    url: "https://youtu.be/Fw4wdaSszu0?start=747&end=750",
    answers: ["せかい", "よ", "われ", "に", "したがえ"],
  },
  {
    url: "https://youtu.be/184zUaSjmUo?start=14&end=16",
    answers: ["な", "に", "し", "て", "る"],
  },
];


export const gameData = [
  {
    id: "1",
    title: "五條悟 Quiz",
    language: "Japanese",
    type: "Listening",
    level: 1,
    questions: questions.slice(0, 3),
  },
  {
    id: "2",
    title: "阿尼亞 Quiz",
    language: "Japanese",
    type: "Listening",
    level: 1,
    questions: questions.slice(3, 7),
  }
]
